# 9 -> 1; 10 -> 0; 11 -> 1; 12 -> 1; 13 -> 1; 14 -> 2; 15 -> 1; 16 -> 3; 
# 18 -> 4; 20 -> 5; 22 -> 6; 24 -> 7; 26 -> 8; 28 -> 9

# 29 -> 2; 30 -> 0; 31 -> 2; 32 -> 1; 33 -> 2; 34 -> 2; 35 -> 2; 36 -> 3;
# 49 -> 3; 50 -> 0
# ... 
# 69 -> 4; 89 -> 5; 109 -> 6; 129 -> 7; 149 -> 8; 169 -> 9; 
# 189 -> 1; 190 -> 0; 191 -> 0; 192 -> 1; 193 -> 0; 194 -> 1

# через 1 символ проходил 1 число (единицы)
# после 0 каждые 20 символов проходит 10 чисел (десятки); 2 -> 1
# после 9+180=189 через каждые 300 символов проходит 100 чисел (сотни); через 30 -> 10; 3 -> 1
# после 9+180+2700=2889 через каждые 4000 -> 1000; 400 -> 100; 40 -> 10; 4 -> 1

def check(n):
    s = ""
    for i in range(1, 100000):
        s += str(i)
    return s[n]

n = int(input())

ans = 0
if n < 9: # single digit numbers
    ans = n
elif n < 189: # double digit numbers
    if n % 2 != 0: # first digit in a number
        ans = n // 20 + 1
    else: # second digit
        ans = ((n-10)%20) // 2

print(ans, check(n))